// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
int A = 22;
int B = 3;
int C = 9;
int m=  A;
if (B>A)

{
    m = B;
}

if (C>m)

{
    m = C;
}
Console.Write(m);
   