// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
int A = 44;
int B = 5;
int C = 78;
int m=  A;
if (B>A)

{
    m = B;
}

if (C>m)

{
    m = C;
}
Console.Write(m);
   