//  Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

int A = 5;
int B = 7;

if (A>B)

{
    Console.WriteLine (A);
}

else

{
    Console.WriteLine (B);
}

