// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
int A=7;
if (A%2==0)
{
    Console.Write("7 четное число");
}
else
{
    Console.Write("7 нечетное число");
}
